__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 192, 144, 3)  0                                            
__________________________________________________________________________________________________
model_1 (Model)                 (None, 24, 18, 512)  1460096     input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 12, 9, 512)   2359808     model_1[1][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 12, 9, 512)   2048        conv2d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 12, 9, 512)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 12, 9, 256)   131328      leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 12, 9, 256)   1024        conv2d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 12, 9, 256)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 12, 9, 256)   590080      leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 12, 9, 256)   1024        conv2d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 12, 9, 256)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 12, 9, 1024)  4719616     leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 12, 9, 1024)  263168      leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 12, 9, 1024)  4096        conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 12, 9, 1024)  4096        conv2d_5[0][0]                   
__________________________________________________________________________________________________
add_17 (Add)                    (None, 12, 9, 1024)  0           batch_normalization_2[0][0]      
                                                                 batch_normalization_5[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 12, 9, 1024)  0           add_17[0][0]                     
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 12, 9, 256)   262400      leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 12, 9, 256)   1024        conv2d_6[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 12, 9, 256)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 12, 9, 256)   590080      leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 12, 9, 256)   1024        conv2d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 12, 9, 256)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 12, 9, 1024)  263168      leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 12, 9, 1024)  4096        conv2d_8[0][0]                   
__________________________________________________________________________________________________
add_18 (Add)                    (None, 12, 9, 1024)  0           leaky_re_lu_4[0][0]              
                                                                 batch_normalization_8[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 12, 9, 1024)  0           add_18[0][0]                     
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 12, 9, 256)   262400      leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 12, 9, 256)   1024        conv2d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 12, 9, 256)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 12, 9, 256)   590080      leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 12, 9, 256)   1024        conv2d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 12, 9, 256)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 12, 9, 1024)  263168      leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 12, 9, 1024)  4096        conv2d_11[0][0]                  
__________________________________________________________________________________________________
add_19 (Add)                    (None, 12, 9, 1024)  0           leaky_re_lu_7[0][0]              
                                                                 batch_normalization_11[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 12, 9, 1024)  0           add_19[0][0]                     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 12, 9, 256)   262400      leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 12, 9, 256)   1024        conv2d_12[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 12, 9, 256)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 12, 9, 256)   590080      leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 12, 9, 256)   1024        conv2d_13[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 12, 9, 256)   0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 12, 9, 1024)  263168      leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 12, 9, 1024)  4096        conv2d_14[0][0]                  
__________________________________________________________________________________________________
add_20 (Add)                    (None, 12, 9, 1024)  0           leaky_re_lu_10[0][0]             
                                                                 batch_normalization_14[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 12, 9, 1024)  0           add_20[0][0]                     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 12, 9, 256)   262400      leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 12, 9, 256)   1024        conv2d_15[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 12, 9, 256)   0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 12, 9, 256)   590080      leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 12, 9, 256)   1024        conv2d_16[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 12, 9, 256)   0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 12, 9, 1024)  263168      leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 12, 9, 1024)  4096        conv2d_17[0][0]                  
__________________________________________________________________________________________________
add_21 (Add)                    (None, 12, 9, 1024)  0           leaky_re_lu_13[0][0]             
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 12, 9, 1024)  0           add_21[0][0]                     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 12, 9, 256)   262400      leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 12, 9, 256)   1024        conv2d_18[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 12, 9, 256)   0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 12, 9, 256)   590080      leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 12, 9, 256)   1024        conv2d_19[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 12, 9, 256)   0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 12, 9, 1024)  263168      leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 12, 9, 1024)  4096        conv2d_20[0][0]                  
__________________________________________________________________________________________________
add_22 (Add)                    (None, 12, 9, 1024)  0           leaky_re_lu_16[0][0]             
                                                                 batch_normalization_20[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 12, 9, 1024)  0           add_22[0][0]                     
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 8, 8, 1024)   0           leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 8, 8, 1, 1024 0           lambda_1[0][0]                   
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 8, 8, 7, 1024 0           lambda_2[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 8, 8, 8, 1024 0           lambda_2[0][0]                   
                                                                 lambda_3[0][0]                   
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 8, 8, 8, 256) 262400      concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 8, 8, 8, 256) 1024        conv3d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 8, 8, 8, 256) 0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 8, 8, 8, 256) 1769728     leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 8, 8, 8, 256) 1024        conv3d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 8, 8, 8, 256) 0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 8, 8, 8, 1024 28312576    concatenate_1[0][0]              
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 8, 8, 8, 1024 263168      leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 8, 8, 8, 1024 4096        conv3d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 8, 8, 8, 1024 4096        conv3d_4[0][0]                   
__________________________________________________________________________________________________
add_23 (Add)                    (None, 8, 8, 8, 1024 0           batch_normalization_21[0][0]     
                                                                 batch_normalization_24[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 8, 8, 8, 1024 0           add_23[0][0]                     
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 8, 8, 8, 256) 262400      leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 8, 8, 8, 256) 1024        conv3d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 8, 8, 8, 256) 0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 8, 8, 8, 256) 1769728     leaky_re_lu_23[0][0]             
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 8, 8, 8, 256) 1024        conv3d_6[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 8, 8, 8, 256) 0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 8, 8, 8, 1024 263168      leaky_re_lu_24[0][0]             
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 8, 8, 8, 1024 4096        conv3d_7[0][0]                   
__________________________________________________________________________________________________
add_24 (Add)                    (None, 8, 8, 8, 1024 0           leaky_re_lu_22[0][0]             
                                                                 batch_normalization_27[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 8, 8, 8, 1024 0           add_24[0][0]                     
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 8, 8, 8, 256) 262400      leaky_re_lu_25[0][0]             
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 8, 8, 8, 256) 1024        conv3d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 8, 8, 8, 256) 0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 8, 8, 8, 256) 1769728     leaky_re_lu_26[0][0]             
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 8, 8, 8, 256) 1024        conv3d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 8, 8, 8, 256) 0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 8, 8, 8, 1024 263168      leaky_re_lu_27[0][0]             
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 8, 8, 8, 1024 4096        conv3d_10[0][0]                  
__________________________________________________________________________________________________
add_25 (Add)                    (None, 8, 8, 8, 1024 0           leaky_re_lu_25[0][0]             
                                                                 batch_normalization_30[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 8, 8, 8, 1024 0           add_25[0][0]                     
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 8, 8, 8, 1)   27649       leaky_re_lu_28[0][0]             
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 8, 8, 8)      0           conv3d_11[0][0]                  
==================================================================================================
Total params: 50,393,985
Trainable params: 48,901,121
Non-trainable params: 1,492,864
__________________________________________________________________________________________________
